{
  "heroes": [
    {
      "id": 1,
      "name": "CAPTAIN AMERICA",
      "realname": "Steve Rogers",
      "team": "Avengers",
      "firstappearance": "1941",
      "createdby": "Joe Simon",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.simplifiedcoding.net/demos/marvel/captainamerica.jpg",
      "bio": "Steven Rogers was born in the Lower East Side of Manhattan, New York City, in 1925 to poor Irish immigrants, Sarah and Joseph Rogers.[54] Joseph died when Steve was a child, and Sarah died of pneumonia while Steve was a teen. By early 1940, before America's entry into World War II, Rogers is a tall, scrawny fine arts student specializing in illustration and a comic book writer and artist."
    },
    {
      "id": 2,
      "name": "IRON MAN",
      "realname": "Tony Stark",
      "team": "Avengers",
      "firstappearance": "1963",
      "createdby": "Stan Lee",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.simplifiedcoding.net/demos/marvel/ironman.jpg",
      "bio": "Anthony Edward Stark, the son of wealthy industrialist and head of Stark Industries, Howard Stark, and Maria Stark. A boy genius, he enters MIT at the age of 15 to study electrical engineering and later receives master's degrees in electrical engineering and physics. After his parents are killed in a car accident, he inherits his father's company."
    },
    {
      "id": 3,
      "name": "WOLVERINE",
      "realname": "James Howlett",
      "team": "X-Men",
      "firstappearance": "1974",
      "createdby": "Len Wein",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.simplifiedcoding.net/demos/marvel/logan.jpg",
      "bio": "Wolverine was born James Howlett in northern Alberta, Canada, during the late 1880s, purportedly to rich farm owners John and Elizabeth Howlett,[27] though he is actually the illegitimate son of the Howletts' groundskeeper, Thomas Logan.[28] After Thomas is thrown off the Howletts' property for an attempted rape perpetrated by his other son, named simply Dog, he returns to the Howlett manor and kills John Howlett. In retaliation, young James kills Thomas with bone claws that emerge from the back of his hands, as his mutation manifests.[29] He flees with his childhood companion, Rose, and grows into manhood on a mining colony in the Yukon, adopting the name \"Logan\".[30] When Logan accidentally kills Rose with his claws, he flees the colony and lives in the wilderness among wolves,[31] until he is captured and placed in a circus.[32] Saul Creed, brother of Victor Creed, frees Logan, but after he betrays Logan and Clara Creed to Nathaniel Essex, Logan drowns Creed in Essex's potion.[33] Logan returns to civilization, residing with the Blackfoot people. Following the death of his Blackfoot lover, Silver Fox, at the hands of Victor Creed, now known as Sabretooth,[34] he is ushered into the Canadian military during World War I. Logan spends time in Madripoor before settling in Japan, where he marries Itsu and has a son, Daken. Logan is unaware of his son for many years."
    },
    {
      "id": 4,
      "name": "SPIDERMAN",
      "realname": "Peter Parker",
      "team": "Avengers",
      "firstappearance": "1962",
      "createdby": "Stan Lee",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.simplifiedcoding.net/demos/marvel/spiderman.jpg",
      "bio": "In Forest Hills, Queens, New York,[43] Midtown High School student Peter Parker is a science-whiz orphan living with his Uncle Ben and Aunt May. As depicted in Amazing Fantasy #15 (Aug. 1962), he is bitten by a radioactive spider (erroneously classified as an insect in the panel) at a science exhibit and \"acquires the agility and proportionate strength of an arachnid\".[44] Along with super strength, Parker gains the ability to adhere to walls and ceilings. Through his native knack for science, he develops a gadget that lets him fire adhesive webbing of his own design through small, wrist-mounted barrels. Initially seeking to capitalize on his new abilities, Parker dons a costume and, as \"Spider-Man\", becomes a novelty television star. However, \"He blithely ignores the chance to stop a fleeing thief, [and] his indifference ironically catches up with him when the same criminal later robs and kills his Uncle Ben.\" Spider-Man tracks and subdues the killer and learns, in the story's next-to-last caption, \"With great power there must also come-great responsibility!\"[45]"
    },
    {
      "id": 5,
      "name": "THOR",
      "realname": "Thor Odinson",
      "team": "Avengers",
      "firstappearance": "1962",
      "createdby": "Stan Lee",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.simplifiedcoding.net/demos/marvel/thor.jpg",
      "bio": "Thor's father Odin decides his son needed to be taught humility and consequently places Thor (without memories of godhood) into the body and memories of an existing, partially disabled human medical student, Donald Blake.[52] After becoming a doctor and on vacation in Norway, Blake witnesses the arrival of an alien scouting party. Blake flees from the aliens into a cave. After discovering Thor's hammer Mjolnir (disguised as a walking stick) and striking it against a rock, he transforms into the thunder god.[53] Later, in Thor #159, Blake is revealed to have always been Thor, Odin's enchantment having caused him to forget his history as The Thunder God and believe himself mortal.[54]"
    },
    {
      "id": 6,
      "name": "DOCTOR STRANGE",
      "realname": "Stephen Strange",
      "team": "Avengers",
      "firstappearance": "1963",
      "createdby": "Steve Ditko",
      "publisher": "Marvel Comics",
      "imageurl": "https://phantom-marca.unidadeditorial.es/2337ec80def791b20156f5351288ab99/resize/1320/f/jpg/assets/multimedia/imagenes/2021/12/22/16402016411702.jpg",
      "bio": "As Earth’s Sorcerer Supreme, Doctor Strange wields arcane spells and mystical artifacts to defend the planet against malevolent threats.\nRecognized the world over as one of the most brilliant neurosurgeons, Stephen Strange’s arrogance and self-centered nature grew alongside his skill until his ego far outweighed his career, proceeding to close himself off from only the most wealthy and influential patients. Everything changed for the man one fateful night when a near-fatal car crash left Strange with severely damaged nerves in both hands and a diagnosis of never being able to operate again."
    },
    {
      "id": 7,
      "name": "MS. MARVEL",
      "realname": "Carol Danvers",
      "team": "Avengers",
      "firstappearance": "1968",
      "createdby": "John Buscema",
      "publisher": "Marvel Comics",
      "imageurl": "https://www.elindependiente.com/wp-content/uploads/2019/03/Carol-Danvers-1440x808.jpg",
      "bio": "Carol Danvers becomes one of the universe's most powerful heroes when Earth is caught in the middle of a galactic war between two alien races."
    },
    {
      "id": 8,
      "name": "DEADPOOL",
      "realname": "Wade Winston Wilson",
      "team": "X-Men",
      "firstappearance": "1991",
      "createdby": "Fabian Nicieza / Rob Liefeld",
      "publisher": "Marvel Comics",
      "imageurl": "https://as01.epimg.net/meristation/imagenes/2020/05/11/noticias/1589190997_006565_1589191075_noticia_normal.jpg",
      "bio": "Wade Wilson was born in Canada, but grew up to become the least Canadian person ever. When it comes to the Merc with a Mouth, with great power comes no responsibility."
    },
    {
      "id": 9,
      "name": "ANT-MAN",
      "realname": "Scot Lang",
      "team": "Avengers",
      "firstappearance": "1979",
      "createdby": "David Michelinie / Bob Layton / John Byrne",
      "publisher": "Marvel Comics",
      "imageurl": "https://i.ytimg.com/vi/DwN_7sKpC1o/maxresdefault.jpg",
      "bio": "Ex-con Scott Lang uses high-tech equipment to shrink down to insect-size and fight injustice as Ant-Man."
    },
    {
      "id": 10,
      "name": "STORM",
      "realname": "Ororo Munroe",
      "team": "X-Men",
      "firstappearance": "1975",
      "createdby": "Len Wein / Dave Cockrum",
      "publisher": "Marvel Comics",
      "imageurl": "https://images4.alphacoders.com/673/thumb-1920-673885.jpg",
      "bio": "Ororo Munroe is a powerful mutant with weather-manipulating abilities, being also known as the windriding, influential super-hero Storm. As the daughter of a Kenyan tribal princess and an American photojournalist who lived in Cairo, Egypt, she became an orphan after a plane crashed on and destroyed her home. The young Ororo became a sneak-thief on the streets of Cairo under the tutelage of Achmed El Gibár, who provided her a home. As a teenager, she felt an urge to travel to the south, arriving to the Serengeti plains. Venerated by the locals as a goddess, Ororo used her abilities to ease the droughts in the arid desert. She was eventually approached by Professor Xavier to join his X-Men, a mutant group aimed at implementing peace between humans and mutants. Adopting the name Storm, Ororo accepted the offer, intending to comprehend the origin and potential of her powers."
    }
  ]
}